In [1]:
import numpy as np
import pandas as pd

se1 = pd.Series(range(4),index = ['a','b','c','d'])

In [2]:
se1.sort_index()

a    0
b    1
c    2
d    3
dtype: int64

In [3]:
se1.sort_index(ascending=False)

d    3
c    2
b    1
a    0
dtype: int64

In [4]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
             index=["three", "one"],
             columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [5]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [6]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [ ]:
se2 = pd.Series([4,7,-3,2])
se3 = pd.Series([4,np.nan,7,np.nan,-3,2])

In [11]:
se3 = pd.Series([4,np.nan,7,np.nan,-3,2])
se3.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [13]:
frame2 =pd.DataFrame({'a':[5,3,6,9],
                      'b':[-9,69,1,0]})
frame2

   a   b
0  5  -9
1  3  69
2  6   1
3  9   0

In [14]:
frame2.sort_values(by ='b')

   a   b
0  5  -9
3  9   0
2  6   1
1  3  69

In [16]:
frame2.sort_values(by =['b','a'])

   a   b
0  5  -9
3  9   0
2  6   1
1  3  69

In [18]:
se3 = pd.Series([7, -5, 7, 4, 2, 0, 4])
se3.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [19]:
display(se3)
se3.rank(ascending= False,method='first')#排名

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [20]:
display(se3)
se3.rank(ascending=False,method='max')#重複假設 1,2名只出現第2，出現大的

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [21]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2],
                     'a':[0, 1, 0,1],
                     'c':[-2, 5, 8, -2.5]})
frame.sort_index(axis='columns').rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0